Revit 2026 API

# SweptProfile Methods

---

The SweptProfile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetDrivingCurve | Provides access to the curve that dictates the path of the swept profile. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSweptProfile | Returns an object that describes the profile that is swept along the driving curve. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

SweptProfile Class

Autodesk.Revit.DB Namespace